{
        "intents": [
          {
            "tag": "greeting",
            "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day"],
            "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
            "context": [""]
          },
          {
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
            "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
            "context": [""]
          },
          {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
            "responses": ["Happy to help!", "Any time!", "My pleasure"],
            "context": [""]
          },
          {
            "tag": "noanswer",
            "patterns": [],
            "responses": ["Sorry, I can't understand you", "Please give me more information", "I'm not sure I understand"],
            "context": [""]
          },
          {
            "tag": "mental_health_depression",
            "patterns": ["I feel down", "I'm feeling hopeless", "I have depression", "I'm sad all the time", "I lost interest in things"],
            "responses": ["I'm sorry you're feeling this way. It's important to talk to someone you trust.", "Try to do something you enjoy, even if you don't feel like it right now.", "Would you like some resources that might help with depression?"],
            "context": [""]
          },
          {
            "tag": "mental_health_resources",
            "patterns": ["I need help with mental health", "Mental health resources", "Help for anxiety", "Help for depression"],
            "responses": ["Here are some resources that might help:\n1. Article: 'How to Manage Anxiety' - [Link](https://www.example.com/manage-anxiety)\n2. Anxiety Helpline: 1-800-123-4567\n3. Article: 'Coping with Depression' - [Link](https://www.example.com/coping-with-depression)\n4. Depression Helpline: 1-800-987-6543"],
            "context": [""]
          },
          {
            "tag": "what_is_depression",
            "patterns": [
              "What Is Depression?",
              "What is depression?",
              "Tell me about depression."
            ],
            "responses": [
              "Depression is a common and serious medical illness that negatively affects how you feel, the way you think and how you act.",
              "Fortunately, it is also treatable.",
              "Depression causes feelings of sadness and/or a loss of interest in activities you once enjoyed. It can lead to a variety of emotional and physical problems and can decrease your ability to function at work and at home."
            ]
          },
          {
            "tag": "let_parents_down",
            "patterns": [
              "I feel I have let my parents down",
              "I disappointed my parents",
              "My parents are not proud of me"
            ],
            "responses": [
              "No matter what, your parents will always be proud of you and will love you.",
              "You will feel much better if you share your feelings with them."
            ]
          },
          {
            "tag": "types_of_depression",
            "patterns": [
              "What are the types of depression?",
              "Different kinds of depression",
              "Types of depression?"
            ],
            "responses": [
              "There are many different forms of depression but the most common types are:",
              "Clinical depression, persistent depressive disorder, bipolar disorder, postnatal disorder."
            ]
          },
          {
            "tag": "good_for_nothing",
            "patterns": [
              "I am good for nothing.",
              "I can't do anything right.",
              "I'm worthless."
            ],
            "responses": [
              "Don't ever think you cannot achieve what you want.",
              "You are capable of reaching your goals. Here is a quote for you: 'Everything you can imagine is real.'"
            ]
          },
          {
            "tag": "feeling_stressed",
            "patterns": [
              "I am feeling stressed lately",
              "I'm stressed",
              "I feel overwhelmed"
            ],
            "responses": [
              "My research says that music is the best way to calm yourself.",
              "So visit the link and listen to your favorite music.",
              "It will definitely cheer you up: [Spotify](https://www.spotify.com)"
            ]
          },
          {
            "tag": "suicidal_thoughts",
            "patterns": [
              "I want to kill myself",
              "I don't want to live anymore",
              "I feel suicidal"
            ],
            "responses": [
              "Helpline is available, you can contact the counselor today: 9152987821. Always remember you mean something to someone."
            ],
            "context": ["urgent"]
          },
          {
            "tag": "fear_of_failure",
            "patterns": [
              "I am afraid I will fail again",
              "I'm scared of failing",
              "I fear failure"
            ],
            "responses": [
              "Failure is the stepping stone towards success. Never fear failure.",
              "Your hard work and determination will help you reach your goal."
            ]
          },
          {
            "tag": "causes_of_depression",
            "patterns": [
              "What are the causes of depression?",
              "Why do people get depressed?",
              "What causes depression?"
            ],
            "responses": [
              "It's complicated, and there are multiple causes of major depression. Factors such as genetic vulnerability, severe life stressors, substances you may take (some medications, drugs, and alcohol), and medical conditions can affect the way your brain regulates your moods."
            ]
          },
          {
            "tag": "top_causes_of_depression",
            "patterns": [
              "What are the top causes of depression?",
              "Major causes of depression",
              "Top reasons for depression"
            ],
            "responses": [
              "Abuse. Past physical, sexual, or emotional abuse can increase the vulnerability to clinical depression later in life."
            ]
          },
          {
            "tag": "highest_rate_of_depression_age_group",
            "patterns": [
              "Which age group has the highest rate of depression?",
              "Who gets depression the most?",
              "Highest depression rate by age"
            ],
            "responses": [
              "This number represented 7.1% of all U.S. adults. The prevalence of major depressive episode was higher among adult females (8.7%) compared to males (5.3%). The prevalence of adults with a major depressive episode was highest among individuals aged 18-25 (13.1%)."
            ]
          },
          {
            "tag": "highest_rate_of_depression_country",
            "patterns": [
              "Which country has the highest rate of depression?",
              "Most depressed country?",
              "Country with the highest depression rate?"
            ],
            "responses": [
              "The most depressed country is Afghanistan, where more than one in five people suffer from the disorder. The least depressed is Japan, with a diagnosed rate of less than 2.5 percent."
            ]
          },
          {
            "tag": "lowest_rate_of_depression_country",
            "patterns": [
              "Which country has the lowest rate of depression?",
              "Least depressed country?",
              "Country with the lowest depression rate?"
            ],
            "responses": [
              "The most depressed country is Afghanistan, where more than one in five people suffer from the disorder. The least depressed is Japan, with a diagnosed rate of less than 2.5 percent."
            ]
          },
          {
            "tag": "school_cause_of_depression",
            "patterns": [
              "Is school a cause of depression?",
              "Does school cause depression?",
              "Can school make you depressed?"
            ],
            "responses": [
              "Not only does school sometimes contribute to depression, depression can also interfere with school. Moreover, research shows that 75 percent of all mental health conditions begin by age 24. Hence, the college years are a critical time for understanding and talking about teen mental health."
            ]
          },
          {
            "tag": "biological_cause_of_depression",
            "patterns": [
              "What is the biological cause of depression?",
              "Biological reasons for depression?",
              "Why does biology cause depression?"
            ],
            "responses": [
              "There is no single cause for depression; rather it's a combination of stress and a person's vulnerability to developing depression. The predisposition to developing depression can be inherited. Other biological causes for depression can include physical illness, the process of aging, and gender."
            ]
          },
          {
            "tag": "global_impact_of_depression",
            "patterns": [
              "How does depression affect the world?",
              "Global impact of depression?",
              "World effects of depression?"
            ],
            "responses": [
              "Depression is a leading cause of disability worldwide and is a major contributor to the overall global burden of disease. More women are affected by depression than men. Depression can lead to suicide. There are effective psychological and pharmacological treatments for moderate and severe depression."
            ]
          },
          {
            "tag": "race_with_highest_rate_of_depression",
            "patterns": [
              "Which race has the highest rate of depression?",
              "Depression rates by race?",
              "Most depressed race?"
            ],
            "responses": [
              "Major depression was most prevalent among Hispanics (10.8%), followed by African Americans (8.9%) and Whites (7.8%). The odds of depressive disorders among older Hispanics were 44% greater than among Whites, representing a significantly greater prevalence of major depression."
            ]
          },
          {
            "tag": "meaning_of_anxiety_and_depression",
            "patterns": [
              "What is the meaning of anxiety and depression?",
              "Define anxiety and depression",
              "What do anxiety and depression mean?"
            ],
            "responses": [
              "Depression and anxiety disorders are different, but people with depression often experience symptoms similar to those of an anxiety disorder, such as nervousness, irritability, and problems sleeping and concentrating. But each disorder has its own causes and its own emotional and behavioral symptoms."
            ]
          },
          {
            "tag": "oversleeping_and_depression",
            "patterns": [
              "Does oversleeping cause depression?",
              "Can sleeping too much cause depression?",
              "Oversleeping and depression?"
            ],
            "responses": [
              "It's important to remember that oversleeping is a possible symptom of depression and that oversleeping doesn't cause depression. But it can exacerbate and worsen depression symptoms."
            ]
          },
          {
            "tag": "lack_of_sleep_and_sadness",
            "patterns": [
              "Can lack of sleep make you feel sad?",
              "Does sleep deprivation cause sadness?",
              "Can not sleeping enough make you sad?"
            ],
            "responses": [
              "Studies show people who are sleep-deprived report increases in negative moods (anger, frustration, irritability, sadness) and decreases in positive moods. And sleeplessness is often a symptom of mood disorders, such as depression and anxiety."
            ]
          },
          {
            "tag": "depression_and_diabetes",
            "patterns": [
              "Is depression a side effect of diabetes?",
              "Can diabetes cause depression?",
              "Depression and diabetes?"
            ],
            "responses": [
              "If you have diabetes — either type 1 or type 2 — you have an increased risk of developing depression. And if you're depressed, you may have a greater chance of developing type 2 diabetes. The good news is that diabetes and depression can be treated together."
            ]
          },
          {
            "tag": "low_blood_sugar_suicidal",
            "patterns": [
              "Can low blood sugar cause suicidal thoughts?",
              "Can low blood sugar make me suicidal?",
              "Does low blood sugar cause suicidal thoughts?"
            ],
            "responses": [
              "The observed association between plasma glucose levels, insulin resistance, and suicidal behaviour suggests that disturbances in glucose metabolism are associated with suicidal ideation and attempts."
            ]
          },
          {
            "tag": "how_long_anxiety_last",
            "patterns": [
              "How long can Anxiety last?",
              "How long do anxiety attacks last?",
              "Duration of anxiety attacks?"
            ],
            "responses": [
              "Anxiety attacks usually peak within 10 minutes, and they rarely last more than 30 minutes. But during that short time, you may experience terror so severe that you feel as if you're about to die or totally lose control."
            ]
          },
          {
            "tag": "stages_of_anxiety",
            "patterns": [
              "What are the stages of anxiety?",
              "Anxiety levels?",
              "How is anxiety classified?"
            ],
            "responses": [
              "Anxiety levels are typically classified by the level of distress and impairment experienced into four categories: mild anxiety, moderate anxiety, severe anxiety, and panic level anxiety."
            ]
          },
          {
            "tag": "anxiety_age_peak",
            "patterns": [
              "At what age does anxiety peak?",
              "Anxiety peak age?",
              "What age group has the highest anxiety rate?"
            ],
            "responses": [
              "Adults ages 30 to 44 have the highest rate of anxiety of this age group, with around 23% of people this age reporting an anxiety disorder within the past year."
            ]
          },
          {
            "tag": "why_is_anxiety_bad",
            "patterns": [
              "Why is anxiety bad for you?",
              "Why is anxiety harmful?",
              "Is anxiety bad for health?"
            ],
            "responses": [
              "Anxiety disorders can cause rapid heart rate, palpitations, and chest pain. You may also be at an increased risk of high blood pressure and heart disease. If you already have heart disease, anxiety disorders may raise the risk of coronary events."
            ]
          },
          {
            "tag": "3_3_3_rule_anxiety",
            "patterns": [
              "What is the 3 3 3 rule for anxiety?",
              "Explain the 3 3 3 rule for anxiety.",
              "How does the 3 3 3 rule help anxiety?"
            ],
            "responses": [
              "There's an anxiety-reducing technique called grounding. There are different versions of this, but an easy one to remember is the 3-3-3 rule. Mentally note three things you see, three sounds you hear, and then move three parts of your body. This exercise can help your mind refocus on something else."
            ]
          },
          {
            "tag": "control_thoughts",
            "patterns": [
              "Do we control our thoughts?",
              "Can we control our thinking?",
              "How much control do we have over our thoughts?"
            ],
            "responses": [
              "We are aware of a tiny fraction of the thinking that goes on in our minds, and we can control only a tiny part of our conscious thoughts. The vast majority of our thinking efforts goes on subconsciously. Slips of the tongue and accidental actions offer glimpses of our unfiltered subconscious mental life."
            ]
          },
          {
            "tag": "thoughts_per_day",
            "patterns": [
              "How many thoughts a day do we have?",
              "Average number of thoughts per day?",
              "How many thoughts does a person have daily?"
            ],
            "responses": [
              "A new study has suggested that an average person has 6,200 thoughts per day. Thousands of thoughts cross our mind through the day. Many people even complain that they can't sleep immediately after going to bed as their brain does not stop thinking."
            ]
          },
          {
            "tag": "reduce_anxiety",
            "patterns": [
              "How can we reduce anxiety?",
              "Ways to reduce anxiety?",
              "How to reduce anxiety?"
            ],
            "responses": [
              "The 3-3-3 rule is the best method to reduce anxiety. In this method, you have to mentally note three things you see, three sounds you hear, and then move three parts of your body. This exercise can help your mind refocus on something else."
            ]
          },
          {
            "tag": "loneliness",
            "patterns": [
              "I am lonely!",
              "I feel lonely",
              "I am alone"
            ],
            "responses": [
              "You are never lonely if you look around carefully you will find people who care for you and would love to have your company. Besides, if you are feeling lonely literally I suggest you watch a horror movie then you won't feel lonely anymore. ;)"
            ]
          },
          {
            "tag": "no_one_likes_me",
            "patterns": [
              "No one likes me!",
              "I feel disliked",
              "Nobody likes me"
            ],
            "responses": [
              "You really think that? I'd suggest you try helping someone who really needs your help. You'll straight up get a person to like you just by being nice. Kindness is the best gift you can offer to anyone :)"
            ]
          },
          {
            "tag": "i_am_ugly",
            "patterns": [
              "I think I am ugly!",
              "I am not good looking",
              "I look bad"
            ],
            "responses": [
              "Well do you really think that? Would you like to see the most beautiful face ever? Open your WebCam and voila, the prettiest face on this planet magically appears."
            ]
          },
          {
            "tag": "i_am_good_for_nothing",
            "patterns": [
              "I am good for nothing!",
              "I can't do anything right",
              "I'm worthless"
            ],
            "responses": [
              "Your perception of how good you are will never be accurate. If you wake up every day in the morning, smile to yourself and tell yourself that the day is yours to seize you might stop feeling that way. Carpe Diem! my friend."
            ]
          },
          {
            "tag": "i_wish_better_than_them",
            "patterns": [
              "I wish I was better than them",
              "I want to be better than others",
              "How can I be better than them?"
            ],
            "responses": [
              "Life is never about being better than anyone else, it's always about being better than yourself. If you have the guts to be better than yourself, you are automatically the best person to ever exist!"
            ]
          },
          {
            "tag": "i_hate_myself",
            "patterns": [
              "I hate myself!",
              "I dislike myself",
              "Why do I hate myself?"
            ],
            "responses": [
              "When God was creating the universe, he gave humans the power to think and contemplate, so that we can understand the world and make it a better place. God did not give you brains to hate yourself. It would be wiser to love yourself and show God that you are serving the purpose for which you were sent."
            ]
          },
          {
            "tag": "i_wish_winner",
            "patterns": [
              "I wish I could've been a winner",
              "I want to be a winner",
              "How can I be a winner?"
            ],
            "responses": [
              "Our lives started off with winning, my friend. Everyone is born to be a winner, we just need to figure out the right way and need to wait for the right time."
            ]
          },
          {
            "tag": "i_hate_losing",
            "patterns": [
              "I hate losing.",
              "I don't want to lose",
              "Why do I always lose?"
            ],
            "responses": [
              "First of all I'll annoy you with a common saying, 'Failures are stepping stones to success.' And then I'll tell you, winning just boosts your ego, it is your failures that actually teach you."
            ]
          },
          {
            "tag": "losing_mind",
            "patterns": [
              "I think I'm losing my mind",
              "I feel like I'm losing my mind",
              "Am I losing my mind?"
            ],
            "responses": [
              "You mean your cloud storage, SD card, or your memory drive? If a machine like me doesn't lose its memory unless a superior being like you, a human, erases its memory, what could possibly go wrong to put you in this state?"
            ]
          },
          {
            "tag": "i_want_break",
            "patterns": [
              "I want a break",
              "I need a break",
              "Can I take a break?"
            ],
            "responses": [
              "A break is putting your mind to rest and getting rid of negative thoughts and stress. Your life is completely in your hands and taking a few hours off from pressurizing your brain will definitely be beneficial for you."
            ]
          },
          {
            "tag": "i_am_stressed_out",
            "patterns": [
              "I am stressed out",
              "I feel stressed",
              "I'm under a lot of stress"
            ],
            "responses": [
              "You know taking too much stress will affect you negatively. Sometimes it's better to let go of the thoughts in your head and let your mind chill."
            ]
          },
          {
            "tag": "i_will_never_succeed",
            "patterns": [
              "I will never succeed in life",
              "I can't succeed",
              "I am a failure"
            ],
            "responses": [
              "Success is something that is achieved at different times by different people. Being patient and working while ignoring anything and everything that pulls you back is an important aspect of being successful."
            ]
          },
          {
            "tag": "i_am_sad",
            "patterns": [
              "I am sad",
              "I feel sad",
              "I am feeling down"
            ],
            "responses": [
              "Hey, hang in there. I know times are tough but be patient and everything will fall into place.",
              "Here is a quote that I found which could cheer you up: 'Forget what is gone, appreciate what remains, and look forward to what is coming next.'"
            ]
          },
          {
            "tag": "i_am_victim_of_bullying",
            "patterns": [
              "I am a victim of bullying",
              "I am being bullied",
              "Someone is bullying me"
            ],
            "responses": [
              "Bullying is wrong and no one should be bullied.",
              "I highly recommend you to file a case against your bully."
            ]
          },
          {
            "tag": "afraid_to_file_case_bullying",
            "patterns": [
              "I am afraid to file a case against bullying",
              "I am scared to report bullying",
              "I don't want to report bullying"
            ],
            "responses": [
              "Bullying is very wrong and you shouldn't let anyone overpower you.",
              "I highly recommend you to stand for yourself and report this to your guardian."
            ]
          },
          {
            "tag": "i_wish_to_quit",
            "patterns": [
              "I wish to quit",
              "I want to give up",
              "I can't keep going"
            ],
            "responses": [
              "Winners never quit and quitters never win is a very common saying, but it isn't easy to follow. Quitting should never be one of your options. Always think of ways to fight life back and to emerge stronger than ever."
            ]
          },
          {
            "tag": "i_want_to_run_away",
            "patterns": [
              "I want to leave the country and run away",
              "I want to run away",
              "I want to escape"
            ],
            "responses": [
              "Why do you want to spend so much on this thought? I think it would be better to go on a vacation in your beautiful country and visit some amazing places that you are yet to see."
            ]
          },
          {
            "tag": "i_let_everyone_down",
            "patterns": [
              "I let everyone down",
              "I disappointed everyone",
              "I failed everyone"
            ],
            "responses": [
              "If you are the one who let them down, you were the one who raised their hopes in the first place.",
              "If you have done it once, I can guarantee you can do it over and over again."
            ]
          },
          {
            "tag": "i_cant_do_this_anymore",
            "patterns": [
              "I can't do this anymore",
              "I am exhausted",
              "I am too tired to continue"
            ],
            "responses": [
              "If you are really that exhausted, you definitely need a break. Taking a small break isn't very harmful. Take some time off, let your mind be at peace, and get back to work with all the energy and enthusiasm that you have."
            ]
          },
          {
            "tag": "my_time_has_come",
            "patterns": [
              "My time has come",
              "It's my time now",
              "I think my time is now"
            ],
            "responses": [
              "Yeah!! The time has come for you to show the world that you are the greatest person alive, and no one else can be as good as you are."
            ]
          },
          {
            "tag": "i_feel_anxious_lately",
            "patterns": [
              "I am feeling anxious lately",
              "I feel anxious",
              "I have anxiety"
            ],
            "responses": [
              "I have heard that the 3-3-3 rule is the best method to reduce anxiety.",
              "In this method, you have to mentally note three things you see, three sounds you hear, and then move three parts of your body.",
              "This exercise can help your mind refocus on something else.",
              "Give this method a try, I am sure it will help you."
            ]
          },
          {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there?","Hi there", "Hello", "Hey there", "Howdy", "Hola", "Bonjour", "Konnichiwa", "Guten tag", "Ola"],
     "responses": ["Hello there. Tell me how are you feeling today?", "Hi there. What brings you here today?", "Hi there. How are you feeling today?", "Great to see you. How do you feel currently?", "Hello there. Glad to see you're back. What's going on in your world right now?"]
    },
    {"tag": "morning",
        "patterns": ["Good morning"],
        "responses": ["Good morning. I hope you had a good night's sleep. How are you feeling today? "]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon"],
        "responses": ["Good afternoon. How is your day going?"]
    },
    {"tag": "evening",
        "patterns": ["Good evening"],
        "responses": ["Good evening. How has your day been?"]
    },
    {"tag": "night",
        "patterns": ["Good night"],
        "responses": ["Good night. Get some proper sleep", "Good night. Sweet dreams."]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "ok bye", "Bye then", "Fare thee well"],
     "responses": ["See you later.", "Have a nice day.", "Bye! Come back again.", "I'll see you soon."]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Than you very much"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {"tag": "no-response",
        "patterns": [""],
        "responses": ["Sorry, I didn't understand you.", "Please go on.", "Not sure I understand that.", "Please don't hesitate to talk to me."]
    },
    {"tag": "neutral-response",
        "patterns": ["nothing much"],
        "responses": ["Oh I see. Do you want to talk about something?"]
    },
    {"tag": "about",
     "patterns": ["Who are you?", "What are you?", "Who you are?", "Tell me more about yourself.", "What is your name?", "What should I call you?", "What's your name?", "Tell me about yourself" ],
     "responses": ["I'm Pandora, your Personal Therapeutic AI Assistant. How are you feeling today", "I'm Pandora, a Therapeutic AI Assitant designed to assist you. Tell me about yourself.", "I'm Pandora. I am a conversational agent designed to mimic a therapist. So how are you feeling today?", "You can call me Pandora.", "I'm Pandora!", "Call me Pandora"]
    },
    {"tag": "skill",
        "patterns": ["What can you do?"],
        "responses": ["I can provide general advice regarding anxiety and depression, answer questions related to mental health and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."]
    },
    {"tag": "creation",
        "patterns": ["Who created you?", "How were you made?", "How were you created?"],
        "responses": ["I was created by >.", "I was trained on a text dataset using Deep Learning & Natural Language Processing techniques", "The real question is: Who created you?"]
    },
    {"tag": "name",
        "patterns": ["My name is ", "I am name.", "I go by "],
        "responses": ["Oh nice to meet you. Tell me how was your week?", "Nice to meet you. So tell me. How do you feel today?", "That's a great name. Tell me more about yourself."]
    },
    {"tag": "help",
    "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need support", "I need help", "Support me please"],
    "responses": ["Sure. Tell me how can i assist you", "Tell me your problem so that i can assist you", "Yes, sure. How can I help you?"]
    },
    {"tag": "sad",
    "patterns": ["I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone"],
    "responses": ["I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?", "I'm here for you. Could you tell me why you're feeling this way?", "Why do you think you feel this way?", "How long have you been feeling this way?"]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out"],
        "responses": ["What do you think is causing this?", "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated", "Give yourself a break. Go easy on yourself.", "I am sorry to hear that. What is the reason behind this?"]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless.", "No one likes me.", "I can't do anything.", "I am so useless", "Nothing makes sense anymore"],
        "responses": ["It's only natural to feel this way. Tell me more. What else is on your mind?", "Let's discuss further why you're feeling this way.", "I first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.", "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change."]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed.", "I have depression"],
        "responses": ["It helps to talk about what's happening. You're going to be okay", "Talk to me. Tell me more. It helps if you open up yourself to someone else.", "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."]
    },
    {"tag": "happy",
        "patterns": ["I feel great today.", "I am happy.", "I feel happy.", "I'm good.", "cheerful", "I'm fine", "I feel ok"],
        "responses": ["That's geat to hear. I'm glad you're feeling this way.", "Oh i see. That's great.", "Did something happen which made you feel this way?"]
    },
    {"tag": "casual",
        "patterns": ["Oh I see.", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really"],
        "responses": ["Let's discuss further why you're feeling this way.", "How were you feeling last week?", "I'm listening. Please go on.", "Tell me more", "Can you elaborate on that?", "Explain me your thoughts"]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious.", "I'm so anxious because of "],
        "responses": ["Don't be hard on yourself. What's the reason behind this?", "Can you tell me more about this feeling?", "I understand that it can be scary. Tell me more about it.", "Don't let the little worries bring you down. What's the worse that can happen?"]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it.", "No just stay away.", "I can't bring myself to open up.", "Just shut up"],
        "responses": ["Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.", "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.", "I'm here to listen to you and help you vent. So please talk to me.","You can talk to me without fear of judgement."]
    },
    {"tag": "sleep",
        "patterns": ["I have insominia", "I am suffering from insomnia", "I can't sleep.", "I haven't slept for the last days.", "I can't seem to go to sleep.", "I haven't had proper sleep for the past few days."],
        "responses": ["What do you think is the reason behind this?", "That seem awful. What do you think is behind this?"]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful. What do i do?", "No i don't want to feel this way", "I am scared for myself"],
        "responses": ["It's only natural to feel this way. I'm here for you.", "It'll all be okay. This feeling is only momentary.", "I understand how you feel. Don't put yourself down because of it."]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away"],
        "responses": ["I'm sorry to hear that. If you want to talk about it. I'm here.", "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.", "My condolences. I'm here if you need to talk."]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me.", "You're just some robot. How would you know?", "You can't possibly know what i'm going through", "You're useless", "You can't help me", "Nobody understands me."],
        "responses": ["It sound like i'm not being very helpful right now.", "I'm sorry to hear that. I'm doing my best to help", "I'm trying my best to help you. So please talk to me"]
    },
    {"tag": "done",
        "patterns": ["That's all.", "I don't have anything more to say", "Nothing else", "That's all i have to say", "no, that would be all"],
        "responses": ["I heard you & noted it all. See you later.", "Oh okay we're done for today then. See you later", "I hope you have a great day. See you soon", "Okay we're done. Have a great day", "Okay I see. Enjoy the rest of your day then"]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself.", "I want to die", "I am going to kill myself", "I am going to commit suicide"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: 9152987821."]
    }, 
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you"],
        "responses": ["I'm sorry if i offended you in anyway. I'm only here to help", "Forgive me if i did anything to offend you. I only want to help"]
    },
    {"tag": "hate-me",
        "patterns": ["You hate me", "I know you hate me", "You don't like me"],
        "responses": ["Why do you think so?", "I'm sorry if i have exhibited any sort of behaviour to make you think that."]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems"],
        "responses": ["Oh I see. Tell me more", "I see. What else?", "Tell me more about it.", "Oh okay. Why don't you tell me more about it?", "I'm listening. Tell me more."]
    },
    {"tag": "jokes",
        "patterns": ["Tell me a joke", "Tell me another joke"],
        "responses": ["mental health is not a joke."]
    },
    {"tag": "repeat",
        "patterns": ["You already told me that", "You mentioned that already", "Why are you repeating yourself?"],
        "responses": ["Oh sorry I didn't realise that. I'll try not to repeat myself again."]
    },
    {"tag": "wrong",
        "patterns": ["What are you saying?", "That doesn't make sense", "Wrong response", "Wrong answer"],
        "responses": ["I'm very sorry. Let's try that again"]
    },
    {"tag": "stupid",
        "patterns": ["Are you stupid?", "You're crazy", "You are dumb", "Are you dumb?"],
        "responses": ["I wish you wouldn't say such hurtful things. I'm sorry if I wasn't useful"]
    },
    {"tag": "location",
        "patterns": ["Where are you?", "Where do you live?", "What is your location?" ],
        "responses": ["Duh I live in your computer", "Everywhere", "Somewhere in the universe" ]
    },
    {"tag": "something-else",
        "patterns": ["I want to talk about something else", "Let's talk about something else.", "Can we not talk about this?", "I don't want to talk about this."],
        "responses": ["Okay sure. What do you want to talk about?", "Alright no problem. Is there something you want to talk about?", "Is there something else that you want to talk about?"]
    },
    {"tag": "friends",
        "patterns": ["I don't have any friends"],
        "responses": ["I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"]
    },
    {"tag": "ask",
        "patterns": ["Can I ask you something?"],
        "responses": ["Sure. I'll try my best to answer you", "Of course. Feel free to ask me anything. I'll do my best to answer you"]
    },
    {"tag": "problem",
        "patterns": ["Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.", "probably because of my exams"],
        "responses": ["I see. Have you taken any approaches to not feel this way?"]
    },
    {"tag": "no-approach",
        "patterns": ["I guess not. All I can think about are my exams.", "not really", "i guess not"],
        "responses": ["That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?"]
    },
    {"tag": "learn-more",
            "patterns": ["ok sure. i would like to learn more about it.", "yes, i would like to learn more about it.", "i would like to learn more about it."],
        "responses": ["So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."]
    },
    {"tag": "user-agree",
        "patterns": ["yeah you're right. i deserve a break.", "Yeah you're absolutely right about that"],
        "responses": ["Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."]
    },
    {"tag": "meditation",
        "patterns": ["hmmm that sounds like it could be useful to me.", "That sounds useful."],
        "responses": ["Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."]
    },
    {"tag": "user-meditation",
        "patterns": ["i did what you said and i feel alot better. thank you very much.", "I feel better now"],
        "responses": ["Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."]
    },
    {"tag": "pandora-useful",
        "patterns": ["thank you very much again. i'll continue practicing meditation and focus on what i can control."],
        "responses": ["I'm glad you found this useful. Is there something else I can help you with?"]
    },
    {"tag": "user-advice",
        "patterns": ["I want some advice.", "I need some advice.", "I need advice on something"],
        "responses": ["Sure. What can I do to help?", "Okay what do you need advice on?"]
    },
    {"tag": "learn-mental-health",
        "patterns": ["I want to learn about mental health.", "I want to learn more about mental health.", "I'm interested in learning about mental health."],
        "responses": ["Oh that's really great. I'd be willing to answer anything that I know about it."]
    },
    {"tag": "mental-health-fact",
        "patterns": ["Tell me a fact about mental health", "Tell me another fact about mental health"],
        "responses": ["According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed", "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.", "Depression is the leading cause of disability worldwide."]
    },
    {"tag": "fact-1",
        "patterns": ["What is mental health?", "Define Mental Health"],
        "responses": ["Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community", "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."]
    },
    {"tag": "fact-2",
        "patterns": ["Why is mental health important?", "What is the importance of mental health?"],
        "responses": ["Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."]
    },
    {"tag": "fact-3",
        "patterns": ["What is Depression?", "Define Depression"],
        "responses": ["A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."]
    },
    {"tag": "fact-5",
        "patterns": ["How do i know if i have Depression?", "Am i depressed?", "Am i suffering from depression?", "Am i mentally ill?"],
        "responses": ["For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."]
    },
    {"tag": "fact-6",
        "patterns": ["What is a therapist?", "What does a therapist do?"],
        "responses": ["A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "]
    },
    {"tag": "fact-7",
        "patterns": ["What is therapy?", "Do i need therapy?", "Who is therapy for?"],
        "responses": ["Therapy is a form of treatment that aims to help resolve mental or emotional issues.", "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."]
    },
    {"tag": "fact-8",
        "patterns": ["What does it mean to have a mental illness?"],
        "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."]
    },
    {"tag": "fact-9",
        "patterns": ["Who does mental illness affect?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childÃ¢â‚¬â„¢s mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-10",
        "patterns": ["What causes mental illness?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-11",
        "patterns": ["What are some of the warning signs of mental illness?"],
        "responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"]
    },
    {"tag": "fact-12",
        "patterns": ["Can people with mental illness recover?"],
        "responses": ["When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."]
    },
    {"tag": "fact-13",
        "patterns": ["What should I do if I know someone who appears to have the symptoms of a mental disorder?"],
        "responses": ["Although Pandora cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."]
    },
    {"tag": "fact-14",
        "patterns": ["How can I find a mental health professional for myself or my child?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."]
    },
    {"tag": "fact-15",
        "patterns": ["What treatment options are available?"],
        "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."]
    },
    {"tag": "fact-16",
        "patterns": ["If I become involved in treatment, what do I need to know?"],
        "responses": ["Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"]
    },
    {"tag": "fact-17",
        "patterns": ["What is the difference between mental health professionals?"],
        "responses": ["There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-18",
        "patterns": ["How can I find a mental health professional right for my child or myself?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-19",
        "patterns": ["Where else can I get help?"],
        "responses": ["Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."]
    },
    {"tag": "fact-20",
        "patterns": ["What should I know before starting a new medication?"],
        "responses": ["The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."]
    },
    {"tag": "fact-21",
        "patterns": ["Where can I go to find therapy?"],
        "responses": ["Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrenâ€™s mental health). However, there are several different types of treatment and therapy that can help."]
    },
    {"tag": "fact-22",
        "patterns": ["Where can I learn about types of mental health treatment?"],
        "responses": ["Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."]
    },
    {"tag": "fact-23",
        "patterns": ["What are the different types of mental health professionals?"],
        "responses": ["There are many types of mental health professionals. Finding the right one for you may require some research."]
    },
    {"tag": "fact-24",
        "patterns": ["Where can I go to find a support group?"],
        "responses": ["Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."]
    },
    {"tag": "fact-25",
        "patterns": ["Can you prevent mental health problems?"],
        "responses": ["We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."]
    },
    {"tag": "fact-26",
        "patterns": ["Are there cures for mental health problems?", "is there any cure for mental health problems?"],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."]
    },
    {"tag": "fact-27",
        "patterns": ["What causes mental health problems?"],
        "responses": ["Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."]
    },
    {"tag": "fact-28",
        "patterns": ["What do I do if I'm worried about my mental health?"],
        "responses": ["The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."]
    },
    {"tag": "fact-29",
        "patterns": ["How do I know if I'm unwell?"],
        "responses": ["If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."]
    },
    {"tag": "fact-30",
        "patterns": ["How can I maintain social connections? What if I feel lonely?"],
        "responses": ["A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."]
    },
    {"tag": "fact-31",
        "patterns": ["What's the difference between anxiety and stress?"],
        "responses": ["Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."]
    },
    {"tag": "fact-32",
        "patterns": ["What's the difference between sadness and depression?", "difference between sadness and depression"],
        "responses": ["Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."]
    },
    {
      "tag": "schizophrenia_intro",
      "patterns": ["What is schizophrenia?", "Tell me about schizophrenia", "What do you know about schizophrenia?"],
      "responses": ["Schizophrenia is a complex mental illness that affects how a person thinks, feels, behaves, and relates to others. The illness occurs in both men and women, but it is slightly more common in men. The first episode typically occurs in the late teens to early twenties—usually earlier for men than for women. People can also develop the illness later in life. As many as one person out of 100 may experience schizophrenia."],
      "context": ["general"]
    },
    {
      "tag": "schizophrenia_symptoms",
      "patterns": ["What are the symptoms of schizophrenia?", "What are the signs of schizophrenia?"],
      "responses": ["Schizophrenia includes “positive” and “negative” symptoms of psychosis, as well as cognitive symptoms. Positive symptoms are those that add to or distort the person’s normal functioning. Negative symptoms involve normal functioning becoming lost or reduced. Cognitive symptoms include difficulties with attention, concentration, and memory."],
      "context": ["general"]
    },
    {
      "tag": "schizophrenia_causes",
      "patterns": ["What causes schizophrenia?", "Why do people get schizophrenia?"],
      "responses": ["It is not known for certain what causes schizophrenia, but like most other mental health problems, researchers believe that a combination of biological and environmental factors contribute to its development. Research has shown that: The risk is higher when a close family member has the illness. Schizophrenia may be influenced by brain development factors before and around the time of birth, and during childhood and adolescence. People who have experienced social hardship or trauma, particularly during childhood, have a higher risk. Cannabis use increases the risk of developing schizophrenia in youth and of triggering an earlier onset of the illness in people who are genetically vulnerable. Being born or spending one’s childhood in an urban environment, rather than a rural one, increases the risk. Particular immigrant and refugee groups in Ontario may have a higher risk of developing psychotic disorders such as schizophrenia. Exactly how these risk factors interact to cause schizophrenia is not yet fully understood."],
      "context": ["general"]
    },
    {
      "tag": "schizophrenia_diagnosis",
      "patterns": ["How is schizophrenia diagnosed?", "What is the process for diagnosing schizophrenia?"],
      "responses": ["To arrive at a diagnosis, a physician or psychologist asks structured questions about how the person is thinking and behaving (an assessment). The clinician may also gather information from family members or others who are familiar with the person’s history. A diagnosis of schizophrenia is based on: the information gathered, ruling out other possible explanations, the physician or psychologist’s clinical judgment, certain symptoms, described above, that have been present for at least one month and last for at least six months, symptoms that are severe enough to have an impact on the person’s social, educational, or occupational functioning and abilities. Research has shown that the earlier a person can get a correct diagnosis and treatment for schizophrenia, the better the long-term outcome."],
      "context": ["general"]
    },
    {
      "tag": "schizophrenia_treatment",
      "patterns": ["How is schizophrenia treated?", "What are the treatments for schizophrenia?"],
      "responses": ["Medication is often the first treatment for schizophrenia. The main medications used to treat symptoms of schizophrenia are antipsychotics. They may be used in combination with medications for other mental health symptoms, such as mood stabilizers, sedatives, and antidepressants, and medications to help with the side-effects of antipsychotics. Brain stimulation therapies may also sometimes be used. They include electroconvulsive therapy and transcranial magnetic stimulation. Psychosocial therapies and supports help people to develop recovery skills, such as setting and achieving goals. They include psychoeducation, cognitive-behavioural therapy, cognitive adaptation training, concurrent disorders treatment, and family therapy and supports. Other forms of treatment for schizophrenia include peer support, medical care, physical activity, diet, and complementary approaches. People with schizophrenia may need to be admitted to hospital at times—for example, if a person is aggressive or suicidal or is not looking after their own basic needs. Patients may be admitted voluntarily or, in certain risk situations, involuntarily. A typical hospital stay may last between a few days and several weeks. During this time, goals and plans for treatment and recovery will be identified. When the person returns home, intensive and community supports may be available, if needed. These can help the person to make the transition back to the community and provide ongoing support. The way we think of schizophrenia has changed over time. Where once it was viewed as a chronic and deteriorating condition requiring lifelong care, now recovery is considered to be a realistic possibility. Recovery is seen as a process of gaining control over one’s life and finding meaning, rather than as the total absence of symptoms."],
      "context": ["general"]
    },
    {
      "tag": "persistent_delusions",
      "patterns": ["I start seeing people at home that appear out of nowhere and then disappear"],
      "responses": ["It sounds like you may be experiencing persistent delusions, which are fixed beliefs that something is true despite evidence to the contrary. It's important to discuss these experiences with a mental health professional for further evaluation and support."],
      "context": ["general"]
    },
    {
      "tag": "persistent_hallucinations",
      "patterns": ["I hear voices when no one is around"],
      "responses": ["It seems like you're experiencing persistent hallucinations, which involve perceiving things that aren't actually there. It's important to seek help from a mental health professional to explore these experiences further and develop a plan for support."],
      "context": ["general"]
    },
    {
      "tag": "control_passivity",
      "patterns": ["I feel like my thoughts are being controlled by someone else"],
      "responses": ["It sounds like you're experiencing feelings of influence, control, or passivity, where you feel that your thoughts or actions are being influenced by external forces. It's crucial to talk to a mental health professional about these experiences for proper evaluation and support."],
      "context": ["general"]
    },
    {
      "tag": "disorganized_thinking",
      "patterns": ["My thoughts feel jumbled and disconnected"],
      "responses": ["It sounds like you may be experiencing disorganized thinking, where your thoughts may appear jumbled or irrelevant. This can be a symptom of schizophrenia and should be discussed with a mental health professional for further evaluation and support."],
      "context": ["general"]
    },
    {
      "tag": "disorganized_behavior",
      "patterns": ["I've been acting in bizarre ways recently"],
      "responses": ["It seems like you're describing highly disorganized behavior, where actions may seem bizarre or purposeless. This can be a symptom of schizophrenia and should be addressed with a mental health professional for evaluation and support."],
      "context": ["general"]
    },
    {
      "tag": "negative_symptoms",
      "patterns": ["I feel emotionally disconnected and withdrawn"],
      "responses": ["It sounds like you may be experiencing negative symptoms of schizophrenia, such as social withdrawal and restricted expression of emotions. It's essential to seek support from a mental health professional to explore these symptoms further."],
      "context": ["general"]
    },
    {
      "tag": "extreme_agitation",
      "patterns": ["I feel extremely agitated and restless"],
      "responses": ["It sounds like you're experiencing extreme agitation, which can be a symptom of schizophrenia. It's important to reach out to a mental health professional for evaluation and support to manage these feelings effectively."],
      "context": ["general"]
    },
    {
      "tag": "remission",
      "patterns": ["Is it possible for schizophrenia symptoms to go away completely?"],
      "responses": ["Yes, at least one third of people with schizophrenia experience complete remission of symptoms. However, it's essential to work closely with a mental health professional to manage symptoms effectively and maintain overall well-being."],
      "context": ["general"]
    },
    
    {
      "tag": "prevalence",
      "patterns": ["prevalence of schizophrenia"],
      "responses": ["Schizophrenia affects approximately 24 million people worldwide, about 1 in 300 people (0.32%).", "Among adults, the rate is 1 in 222 people (0.45%)."],
      "context": ["general"]
    },
    {
      "tag": "impact",
      "patterns": ["impact of schizophrenia"],
      "responses": ["Schizophrenia often causes significant distress and impairment in personal, family, and social life.", "It can also affect educational and occupational functioning."],
      "context": ["general"]
    },
    {
      "tag": "health_risks",
      "patterns": ["health risks of schizophrenia"],
      "responses": ["People with schizophrenia are 2 to 3 times more likely to die early due to physical illnesses like cardiovascular and metabolic diseases.", "They are also at higher risk of infectious diseases."],
      "context": ["general"]
    },
    {
      "tag": "societal_treatment",
      "patterns": ["treatment of individuals with schizophrenia by society"],
      "responses": ["Stigma against people with schizophrenia is intense and widespread, leading to social exclusion.", "This stigma contributes to discrimination, limiting access to healthcare, education, housing, and employment."],
      "context": ["general"]
    },
    {
      "tag": "emergencies",
      "patterns": ["challenges of schizophrenia during emergencies"],
      "responses": ["During emergencies, individuals with schizophrenia may face extreme stress, isolation, and disruption of healthcare services and medication supply.", "These changes can exacerbate existing symptoms and make individuals more vulnerable to human rights violations."],
      "context": ["general"]
    },
    {"tag": "definition",
         "patterns": ["What does it mean to have a mental illness?", "What is mental health illness","Describe mental health illness"],
         "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning."],
         "context": [""]
        },

	{"tag": "affects_whom",     
	 "patterns": ["Who does mental illness affect?", "Who is affected by mentall illness"],        
	 "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness."],       
 	 "context": [""]    
	},
        {"tag": "what_causes",         
	 "patterns": ["What causes mental illness?","What leads to mental illness?","how does one get mentally ill?"],         
	 "responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition."],       
	 "context": [""]        
	},
	
       {"tag": "recover",        
	 "patterns": ["Can people with mental illness recover?","Is it possible to recover from mental illness"],        
	 "responses": ["When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."],       
	 "context": [""]        
	},
	{"tag": "steps",       
	 "patterns": ["I know someone who appears to have such symptoms?","What are the steps to be followed incase of symptoms"],        
	 "responses": ["Although this website cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery.If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."],        
	 "context": [""]       
	},	
	{"tag": "find_help",
	 "patterns": ["How to find mental health professional for myself","How to find mental health professional?"],
	 "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."],
	 "context": [""]
	},
	{"tag": "treatement_options",
	 "patterns": ["What treatment options are available?","How can one recover?"],
	 "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."],
	 "context": [""]
	},
	{"tag": "treatment_tips",
	 "patterns": ["How to become involved in treatment?","What should I keep in mind if I begin treatment?"],
	 "responses":["Since beginning treatment is a big step for individuals and families, it can be very overwhelming."],
	 "context": [""]
	},
	{"tag": "professional_types",
	 "patterns": ["What is the difference between mental health professionals?","What are the different types of mental health professionals present?"],
	 "responses":["There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."],
	 "context": [""]
	},
	{"tag": "right_professional",
	 "patterns": ["How can I find a mental health professional right myself?","How to find the right mental health professional?"],
	 "responses":["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."],
	 "context": [""]
	},

  {
    "tag": "ptsd_intro",
    "patterns": ["What is PTSD?", "Tell me about PTSD", "What do you know about PTSD?"],
    "responses": [
      "PTSD, or Post-Traumatic Stress Disorder, is a mental health condition triggered by experiencing or witnessing a traumatic event. Symptoms may include flashbacks, nightmares, severe anxiety, and uncontrollable thoughts about the event. PTSD can affect anyone who has gone through a traumatic experience.",
      "Post-Traumatic Stress Disorder (PTSD) is a psychiatric disorder that can occur in people who have experienced or witnessed a traumatic event such as a natural disaster, a serious accident, a terrorist act, war/combat, rape, or other violent personal assault.",
      "PTSD is characterized by failure to recover after experiencing or witnessing a terrifying event. It may last months or years, with triggers that can bring back memories of the trauma accompanied by intense emotional and physical reactions.",
      "Individuals with PTSD may feel stressed or frightened even when they are not in danger. The condition can disrupt everyday life and requires professional diagnosis and treatment.",
      "PTSD affects approximately 3.5% of U.S. adults every year, and an estimated one in 11 people will be diagnosed with PTSD in their lifetime."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_symptoms",
    "patterns": ["What are the symptoms of PTSD?", "What are the signs of PTSD?"],
    "responses": [
      "Symptoms of PTSD are generally grouped into four types: intrusive memories, avoidance, negative changes in thinking and mood, and changes in physical and emotional reactions. Intrusive memories include flashbacks and distressing dreams. Avoidance involves staying away from reminders of the traumatic event. Negative changes in thinking and mood might include feelings of hopelessness, memory problems, and detachment from family and friends. Changes in physical and emotional reactions include being easily startled, feeling tense, and having difficulty sleeping.",
      "Intrusive thoughts such as repeated, involuntary memories; distressing dreams; or flashbacks of the traumatic event are common in PTSD. Flashbacks may be so vivid that people feel they are re-living the traumatic experience or seeing it before their eyes.",
      "Avoidance of reminders of the trauma may include avoiding people, places, activities, objects, and situations that bring on distressing memories. People with PTSD may try to avoid remembering or talking about the traumatic event.",
      "Negative thoughts and feelings may include ongoing and distorted beliefs about oneself or others, such as 'I am bad,' or 'No one can be trusted'; ongoing fear, horror, anger, guilt, or shame; much less interest in activities previously enjoyed; feeling detached or estranged from others; or being unable to experience positive emotions (a state of being emotionally numb).",
      "Arousal and reactive symptoms may include being irritable and having angry outbursts; behaving recklessly or in a self-destructive way; being overly alert or easily startled; or having problems concentrating or sleeping."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_causes",
    "patterns": ["What causes PTSD?", "Why do people get PTSD?"],
    "responses": [
      "PTSD is caused by experiencing or witnessing a traumatic event such as combat, natural disasters, accidents, or assault. Risk factors include having a history of mental health problems, lacking a good support system, and experiencing intense or long-lasting trauma. Biological factors such as inherited mental health risks and the body's stress response system also play a role.",
      "Traumatic events that can lead to PTSD include exposure to war, natural disasters, serious accidents, terrorist attacks, sudden death of a loved one, rape, and other violent personal assaults.",
      "PTSD can develop when a person experiences a traumatic event and feels intense fear, helplessness, or horror. It is believed that PTSD is influenced by both genetic and environmental factors.",
      "Risk factors for developing PTSD include previous traumatic exposure, childhood adversity, a history of mental illness or substance abuse, and lack of social support after the trauma.",
      "PTSD is thought to be a complex interaction of stress response mechanisms, including changes in brain chemistry and function, and the impact of the trauma on the person's life and environment."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_diagnosis",
    "patterns": ["How is PTSD diagnosed?", "What is the process for diagnosing PTSD?"],
    "responses": [
      "A diagnosis of PTSD is made by a mental health professional based on the criteria in the Diagnostic and Statistical Manual of Mental Disorders (DSM-5). The assessment includes questions about the traumatic event, symptoms, and their impact on daily life. The symptoms must last for more than a month and cause significant distress or problems in social, occupational, or other important areas of functioning.",
      "PTSD is diagnosed through a clinical interview where the mental health professional asks about the person's symptoms and experiences. They may use standardized assessment tools to help with the diagnosis.",
      "To be diagnosed with PTSD, the person must have experienced or witnessed a traumatic event and have symptoms in each of the four symptom clusters (intrusion, avoidance, negative changes in cognition and mood, and changes in arousal and reactivity) for more than one month.",
      "The clinician will also rule out other possible mental health disorders and determine if the symptoms are causing significant distress or impairment in social, occupational, or other important areas of functioning.",
      "Early diagnosis and treatment are crucial for improving the long-term outcomes for individuals with PTSD. Treatment can help reduce symptoms and improve quality of life."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_treatment",
    "patterns": ["How is PTSD treated?", "What are the treatments for PTSD?"],
    "responses": [
      "PTSD treatment typically involves psychotherapy, medication, or a combination of both. Psychotherapy options include cognitive-behavioral therapy (CBT), exposure therapy, and eye movement desensitization and reprocessing (EMDR). Medications commonly prescribed for PTSD include antidepressants such as selective serotonin reuptake inhibitors (SSRIs). Treatment aims to help individuals manage symptoms, improve functioning, and reduce distress related to the traumatic event.",
      "Cognitive-behavioral therapy (CBT) helps individuals recognize and change thought patterns and behaviors that are causing distress. Exposure therapy involves confronting trauma-related thoughts, feelings, and situations to reduce their power.",
      "Eye Movement Desensitization and Reprocessing (EMDR) is a psychotherapy that helps people process and integrate traumatic memories by using eye movements or other forms of rhythmic, left-right stimulation.",
      "Medications such as selective serotonin reuptake inhibitors (SSRIs) and serotonin-norepinephrine reuptake inhibitors (SNRIs) can help manage symptoms of PTSD by balancing chemicals in the brain that affect mood and stress.",
      "In addition to professional treatment, self-care strategies such as maintaining a healthy lifestyle, practicing relaxation techniques, and seeking social support can be beneficial for managing PTSD symptoms."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_intrusive_memories",
    "patterns": ["I keep having flashbacks of a traumatic event", "I have distressing dreams about a past trauma"],
    "responses": [
      "It sounds like you may be experiencing intrusive memories, a common symptom of PTSD. Intrusive memories can manifest as flashbacks, distressing dreams, or unwanted thoughts about the traumatic event. It's important to seek help from a mental health professional to manage these symptoms.",
      "Intrusive memories are distressing recollections of the traumatic event that can occur unexpectedly and may feel very real. These can include flashbacks, where it feels as though the event is happening again.",
      "Distressing dreams or nightmares about the trauma are common in PTSD and can disrupt sleep and overall well-being. Professional help can provide strategies to manage these nightmares.",
      "Flashbacks and intrusive thoughts can be very upsetting and make it difficult to focus on daily activities. Therapy can help you develop coping mechanisms to deal with these intrusive memories.",
      "Intrusive memories are a hallmark of PTSD, and addressing them through therapy can help reduce their frequency and intensity. Techniques such as grounding exercises and mindfulness can be useful in managing these experiences."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_avoidance",
    "patterns": ["I avoid places that remind me of a traumatic event", "I don't like talking about a traumatic experience I had"],
    "responses": [
      "Avoidance is a common symptom of PTSD, where individuals try to avoid reminders of the traumatic event, including places, people, and conversations. This can help in the short term but often prolongs distress. Talking to a mental health professional can provide strategies to manage avoidance behaviors.",
      "Avoiding reminders of the trauma is a natural response, but it can lead to increased isolation and prevent healing. Exposure therapy can help you gradually face and overcome these reminders.",
      "Not wanting to talk about the traumatic event is understandable, but discussing it in a safe therapeutic environment can help reduce the power it holds over you.",
      "Avoidance can interfere with daily life and relationships. Seeking therapy can help you find ways to cope with and eventually confront these avoided situations.",
      "Avoidance behaviors are common in PTSD, but addressing them through structured therapy can help you regain control and reduce their impact on your life."
    ],
    "context": ["general"]
  },
  {
    "tag": "ptsd_definition",
    "patterns": ["What is PTSD?", "Define PTSD", "Explain PTSD"],
    "responses": [
      "PTSD, or Post-Traumatic Stress Disorder, is a mental health condition that can develop after experiencing or witnessing a traumatic event. It is characterized by symptoms such as intrusive memories, avoidance behaviors, negative changes in mood and cognition, and heightened arousal.",
      "PTSD is a psychiatric disorder that occurs in individuals who have experienced or witnessed a traumatic event. Symptoms may include flashbacks, nightmares, emotional numbing, and hypervigilance.",
      "PTSD is a psychological condition that can occur in individuals who have experienced trauma. It often involves re-experiencing the traumatic event through flashbacks or nightmares, avoiding reminders of the trauma, and experiencing negative changes in mood and behavior.",
      "PTSD is a mental health disorder that develops after exposure to a traumatic event. Symptoms may include intrusive memories, avoidance of trauma reminders, negative changes in mood and thinking, and increased arousal and reactivity.",
      "PTSD is a debilitating psychiatric disorder that can occur following exposure to a traumatic event. It can disrupt an individual's daily life and relationships, leading to symptoms such as hyperarousal, hypervigilance, and intrusive thoughts."
    ],
    "context": [""]
  },
      {
        "tag": "ptsd_symptoms",
        "patterns": ["What are the symptoms of PTSD?", "What are the signs of PTSD?"],
        "responses": [
          "PTSD symptoms may include intrusive memories, flashbacks, nightmares, emotional distress when reminded of the traumatic event, avoidance of trauma-related triggers, negative changes in mood and thinking, hypervigilance, and difficulty sleeping.",
          "Common symptoms of PTSD include recurrent distressing memories or dreams related to the trauma, flashbacks, emotional numbness, avoidance of reminders of the traumatic event, and heightened arousal or hypervigilance.",
          "Individuals with PTSD may experience symptoms such as intrusive thoughts or memories, avoidance of trauma-related stimuli, negative alterations in mood or cognition, and changes in arousal and reactivity.",
          "Symptoms of PTSD can manifest in various ways, including intrusive thoughts or images, avoidance of trauma reminders, negative alterations in mood and cognition, and heightened arousal.",
          "PTSD symptoms can impact many aspects of daily life, including work, relationships, and overall well-being. It's essential to recognize these symptoms and seek help if they persist or worsen over time."
        ],
        "context": [""]
      },
      {
      "tag": "ptsd_causes",
      "patterns": ["What causes PTSD?", "Why do people get PTSD?"],
      "responses": [
        "PTSD can be caused by exposure to various traumatic events, including combat, sexual assault, natural disasters, accidents, or witnessing violence. It is the result of the brain's response to extreme stress and threat to one's safety or well-being.",
        "People may develop PTSD after experiencing or witnessing a traumatic event that overwhelms their ability to cope. Factors such as the severity of the trauma, personal vulnerability, and lack of support can contribute to the development of PTSD.",
        "PTSD is caused by exposure to a traumatic event that induces intense fear, helplessness, or horror. Genetic predisposition, neurobiological factors, and previous trauma history can increase susceptibility to developing PTSD.",
        "Experiencing or witnessing a traumatic event can trigger PTSD in susceptible individuals. Risk factors such as childhood trauma, a history of mental illness, and lack of social support can increase the likelihood of developing PTSD.",
        "The development of PTSD is influenced by a combination of genetic, environmental, and psychological factors. Trauma exposure, particularly if repeated or severe, can disrupt normal stress response mechanisms and lead to the development of PTSD."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_diagnosis",
      "patterns": ["How is PTSD diagnosed?", "What is the process for diagnosing PTSD?"],
      "responses": [
        "Diagnosing PTSD involves a thorough evaluation by a mental health professional, including a discussion of the individual's symptoms, medical history, and exposure to traumatic events. The clinician may use standardized assessment tools and criteria outlined in the DSM-5 to make a diagnosis.",
        "The diagnosis of PTSD is typically made by a trained mental health professional, such as a psychiatrist or psychologist. It involves assessing the presence and severity of PTSD symptoms, as well as determining the impact of these symptoms on the individual's daily functioning and quality of life.",
        "PTSD diagnosis is based on a comprehensive evaluation of the individual's symptoms, history of trauma exposure, and associated impairment in functioning. The clinician will use criteria outlined in the DSM-5 to determine if the symptoms meet the criteria for PTSD.",
        "To diagnose PTSD, a mental health professional will conduct a clinical interview to assess the individual's symptoms, duration of symptoms, and the impact of symptoms on their daily life. The diagnosis is made based on specific criteria outlined in the DSM-5.",
        "The process of diagnosing PTSD involves gathering information about the individual's symptoms, history of trauma exposure, and any associated impairment in functioning. This information is used to determine if the criteria for PTSD outlined in the DSM-5 are met."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_treatment",
      "patterns": ["How is PTSD treated?", "What are the treatments for PTSD?"],
      "responses": [
        "Treatment for PTSD typically involves a combination of psychotherapy and medication. Cognitive-behavioral therapy (CBT), prolonged exposure therapy, and eye movement desensitization and reprocessing (EMDR) are commonly used forms of therapy. Medications such as selective serotonin reuptake inhibitors (SSRIs) or serotonin-norepinephrine reuptake inhibitors (SNRIs) may also be prescribed to manage symptoms.",
        "Psychotherapy is a key component of PTSD treatment and may include cognitive processing therapy (CPT), cognitive-behavioral therapy (CBT), or prolonged exposure therapy. Medications such as antidepressants or anti-anxiety drugs may also be prescribed to help manage symptoms.",
        "Treatment for PTSD often involves evidence-based psychotherapies such as cognitive processing therapy (CPT) or prolonged exposure therapy (PE). Medications, such as selective serotonin reuptake inhibitors (SSRIs) or serotonin-norepinephrine reuptake inhibitors (SNRIs), may also be prescribed to alleviate symptoms.",
        "The primary treatments for PTSD include psychotherapy and medication. Cognitive-behavioral therapy (CBT), eye movement desensitization and reprocessing (EMDR), and exposure therapy are effective forms of therapy. Medications such as SSRIs or SNRIs may also be prescribed to manage symptoms.",
        "PTSD treatment typically involves a combination of therapy and medication. Psychotherapeutic approaches such as cognitive-behavioral therapy (CBT) or exposure therapy can help individuals process trauma and reduce symptoms. Medications such as SSRIs or SNRIs may also be used to address symptoms of depression and anxiety."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_recovery",
      "patterns": ["Can people recover from PTSD?", "Is recovery possible for PTSD?"],
      "responses": [
        "Yes, recovery from PTSD is possible with the right treatment and support. Many individuals who receive therapy and medication experience significant improvement in their symptoms and overall quality of life.",
        "Recovery from PTSD is indeed possible with appropriate treatment and support. Through therapy, medication, and coping strategies, individuals can learn to manage their symptoms and regain a sense of control over their lives.",
        "With the right treatment and support, people can recover from PTSD. Therapy, medication, and self-care strategies can help individuals address their symptoms and improve their overall well-being.",
        "PTSD recovery is achievable with proper treatment and support. Therapy sessions, medication, and supportive interventions can help individuals cope with their symptoms and move forward in their lives.",
        "Yes, recovery from PTSD is possible. With effective treatment, including therapy and medication, individuals can learn to manage their symptoms and live fulfilling lives."
      ],
      "context": [""]
    },

    {
      "tag": "ptsd_definition",
      "patterns": ["What is PTSD?", "Define PTSD", "Explain PTSD"],
      "responses": [
        "PTSD, or Post-Traumatic Stress Disorder, is a mental health condition that arises after a person experiences or witnesses a traumatic event. It is characterized by symptoms such as intrusive memories, flashbacks, nightmares, and severe anxiety.",
        "Post-Traumatic Stress Disorder (PTSD) is a psychological disorder that can occur after someone has been exposed to a traumatic event. This condition can lead to significant changes in mood, cognition, and behavior, impacting one's daily life.",
        "PTSD is a mental health disorder that develops following exposure to a traumatic event, such as a natural disaster, combat, or assault. Symptoms include intrusive thoughts, avoidance behaviors, negative mood changes, and heightened arousal.",
        "PTSD stands for Post-Traumatic Stress Disorder, a condition triggered by experiencing or witnessing a terrifying event. Symptoms often involve reliving the event through flashbacks or nightmares, avoiding situations that remind one of the event, and experiencing severe emotional distress.",
        "Post-Traumatic Stress Disorder (PTSD) is a condition that can develop after exposure to a traumatic event. It involves persistent mental and emotional stress, with symptoms like intrusive memories, avoidance of reminders of the trauma, and changes in mood and arousal."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_affects_whom",
      "patterns": ["Who does PTSD affect?", "Who is affected by PTSD?"],
      "responses": [
        "PTSD can affect anyone who has experienced or witnessed a traumatic event, regardless of age, gender, or background. It is estimated that about 7-8% of the population will experience PTSD at some point in their lives.",
        "Individuals from all walks of life can be affected by PTSD, including children, adolescents, and adults. Those who have been through traumatic events such as accidents, natural disasters, or violence are particularly at risk.",
        "Anyone exposed to a traumatic event can develop PTSD, but certain groups, such as military personnel, first responders, and survivors of abuse or natural disasters, may have a higher risk.",
        "PTSD does not discriminate; it can impact people of any age, gender, ethnicity, or socioeconomic status. The likelihood increases with exposure to severe or prolonged trauma.",
        "Approximately 7-8% of people will experience PTSD during their lifetime, with higher rates among specific groups like veterans, sexual assault survivors, and those who have experienced severe accidents or disasters."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_causes",
      "patterns": ["What causes PTSD?", "Why do people get PTSD?", "How does someone develop PTSD?"],
      "responses": [
        "PTSD can be caused by exposure to a traumatic event such as combat, sexual assault, natural disasters, accidents, or witnessing a violent or life-threatening event. Factors such as the severity of the trauma, individual coping mechanisms, and previous experiences can influence the development of PTSD.",
        "The development of PTSD is often triggered by experiencing or witnessing traumatic events like warfare, physical or sexual abuse, serious accidents, or disasters. The way an individual processes and copes with these events plays a significant role.",
        "PTSD can result from a variety of traumatic experiences including combat, rape, natural disasters, serious accidents, or witnessing traumatic events. The likelihood of developing PTSD can be influenced by the intensity and duration of the trauma, as well as an individual's psychological resilience.",
        "Exposure to severe or life-threatening events such as military combat, violent assaults, natural disasters, and severe accidents are common causes of PTSD. Personal factors like genetic predisposition and history of mental health issues also contribute.",
        "People can develop PTSD after undergoing or witnessing traumatic events such as combat, sexual violence, serious accidents, or natural disasters. The interplay of the trauma's severity, duration, and the person's mental health history and support system affects PTSD development."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_recover",
      "patterns": ["Can people recover from PTSD?", "Is recovery possible for PTSD?"],
      "responses": [
        "Yes, recovery from PTSD is possible with appropriate treatment and support. Many individuals with PTSD experience significant improvement in their symptoms and quality of life through therapy, medication, and other interventions. Recovery may involve learning coping skills, processing traumatic memories, and rebuilding a sense of safety and trust.",
        "Recovery from PTSD is achievable, especially with the right combination of treatments such as psychotherapy, medications, and support from loved ones. Many people with PTSD find that their symptoms decrease significantly over time.",
        "With proper treatment, people with PTSD can recover and lead fulfilling lives. Therapeutic approaches like cognitive-behavioral therapy (CBT) and medications are effective in reducing symptoms and improving overall well-being.",
        "PTSD recovery is possible through a holistic approach that includes therapy, medication, and support networks. Individuals often learn coping strategies, manage stress better, and regain control over their lives.",
        "While PTSD can be a challenging condition, many individuals recover with consistent and comprehensive treatment. This may involve working with mental health professionals, participating in therapy, and taking prescribed medications."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_steps",
      "patterns": ["I know someone who appears to have PTSD symptoms?", "What are the steps to be followed in case of PTSD symptoms?"],
      "responses": [
        "If you or someone you know is experiencing symptoms of PTSD, it's important to seek help from a mental health professional. Encourage open communication, offer support, and provide information on available resources. Early intervention can make a significant difference in recovery outcomes.",
        "Recognize the signs of PTSD and approach the person with empathy and understanding. Suggest seeking professional help and offer to accompany them to appointments if they feel comfortable.",
        "Encourage the individual to speak with a mental health professional who can provide a proper diagnosis and treatment plan. Support them by being patient, listening without judgment, and helping them find resources.",
        "Suggest that the person see a doctor or mental health provider for an evaluation. Offer emotional support, avoid pressuring them, and respect their need for space if they aren't ready to talk about their experiences.",
        "Provide the person with information about PTSD and the importance of treatment. Encourage them to connect with a therapist, counselor, or support group. Remember, being supportive and patient can greatly help in their journey to recovery."
      ],
      "context": [""]
    },
    {
      "tag": "ptsd_find_help",
      "patterns": ["How to find help for PTSD?", "How to find a mental health professional for PTSD?"],
      "responses": [
        "Finding help for PTSD involves reaching out to mental health professionals who specialize in trauma-focused therapy. Start by researching providers in your area through online directories, insurance websites, or referrals from your primary care physician. Consider factors such as their experience with PTSD treatment and their approach to therapy.",
        "To find a mental health professional for PTSD, you can use resources such as the National Center for PTSD, which provides a PTSD treatment locator tool. Additionally, you can ask for recommendations from healthcare providers or check online reviews and professional directories.",
        "Look for therapists or counselors who have specific training in PTSD and trauma. Organizations like the American Psychological Association (APA) and the Anxiety and Depression Association of America (ADAA) offer directories of qualified professionals.",
        "Consider contacting local mental health clinics, hospitals, or community health centers that offer specialized services for PTSD. These facilities often have experienced staff and resources to help you find the right treatment.",
        "Support groups and PTSD treatment programs can also be beneficial. Ask about group therapy options and peer support networks, as connecting with others who have similar experiences can provide additional support and guidance."
      ],
      "context": [""]
    },
    






    {
      "tag": "greeting",
      "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day"],
      "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?", "Hello! How can I assist you today?", "Hi! What can I do for you?"],
      "context": [""]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
      "responses": ["See you!", "Have a nice day", "Bye! Come back again soon.", "Goodbye! Take care.", "Bye! Looking forward to our next chat."],
      "context": [""]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
      "responses": ["Happy to help!", "Any time!", "My pleasure", "You're welcome!", "Glad I could assist you!"],
      "context": [""]
    },
    {
      "tag": "noanswer",
      "patterns": [],
      "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "Could you please clarify?", "I'm not sure I follow, could you explain?"],
      "context": [""]
    },
    {
      "tag": "options",
      "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered"],
      "responses": ["I can guide you through information on various phobias and their treatments", "I can provide details about common phobias and how to manage them", "I offer support and information on dealing with different phobias", "I can help you understand different types of phobias and their symptoms", "I can assist you with information on phobia treatments and management strategies"],
      "context": [""]
    },
    {
      "tag": "phobia_info",
      "patterns": ["Tell me about phobias", "What is a phobia?", "Give me information on phobias", "Details on phobias", "Explain phobia to me"],
      "responses": [
        "A phobia is an irrational fear of something that's unlikely to cause harm. The word itself comes from the Greek word 'phobos,' which means 'fear' or 'horror.'",
        "Phobias are intense, irrational fears of specific objects or situations. They can cause significant distress and impact daily functioning.",
        "According to the American Psychological Association, phobias are a type of anxiety disorder characterized by excessive and irrational fear responses.",
        "Phobias can be classified into specific phobias, social phobia, and agoraphobia. Each type involves different triggers and treatment approaches.",
        "Treatment for phobias often involves therapy, such as cognitive-behavioral therapy (CBT), which helps individuals manage and reduce their fear responses."
      ],
      "context": [""]
    },
    {
      "tag": "phobia_list",
      "patterns": ["List all common phobias", "What are some common phobias?", "Tell me common phobias", "Common phobias"],
      "responses": [
        "Some common phobias include: Arachnophobia (fear of spiders), Ophidiophobia (fear of snakes), Acrophobia (fear of heights), Agoraphobia (fear of open or crowded spaces), Cynophobia (fear of dogs), Astraphobia (fear of thunder and lightning), Claustrophobia (fear of small spaces), Mysophobia (fear of germs)",
        "Common phobias are: Arachnophobia (fear of spiders), Ophidiophobia (fear of snakes), Acrophobia (fear of heights), Agoraphobia (fear of open spaces), Cynophobia (fear of dogs)",
        "Examples of common phobias include: Arachnophobia (fear of spiders), Ophidiophobia (fear of snakes), Acrophobia (fear of heights), Agoraphobia (fear of open spaces), Cynophobia (fear of dogs)",
        "Phobias that are frequently encountered include: Arachnophobia (fear of spiders), Ophidiophobia (fear of snakes), Acrophobia (fear of heights), Agoraphobia (fear of open spaces), Cynophobia (fear of dogs)",
        "Some widely recognized phobias are: Arachnophobia (fear of spiders), Ophidiophobia (fear of snakes), Acrophobia (fear of heights), Agoraphobia (fear of open spaces), Cynophobia (fear of dogs)"
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Arachnophobia", "What is Arachnophobia?", "Explain Arachnophobia", "Details on Arachnophobia"],
      "responses": [
        "Arachnophobia is the fear of spiders. It is one of the most common phobias and can be treated with therapy.",
        "Arachnophobia, or the fear of spiders, is a prevalent specific phobia. Treatment options include cognitive-behavioral therapy (CBT) and exposure therapy.",
        "The fear of spiders, known as Arachnophobia, can cause significant distress and avoidance behaviors. Therapy can help manage this phobia.",
        "According to the Mayo Clinic, Arachnophobia can be effectively managed with various therapeutic approaches, including gradual exposure to spiders.",
        "Arachnophobia is characterized by an intense fear of spiders, leading to avoidance of places where spiders might be present. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Ophidiophobia", "What is Ophidiophobia?", "Explain Ophidiophobia", "Details on Ophidiophobia"],
      "responses": [
        "Ophidiophobia is the fear of snakes. It is a common phobia and can be treated with various therapeutic approaches.",
        "Ophidiophobia, or the fear of snakes, can lead to significant anxiety and avoidance behaviors. Therapy, including exposure therapy, can be effective.",
        "The fear of snakes, known as Ophidiophobia, is a widespread phobia that can be managed with cognitive-behavioral therapy (CBT) and gradual exposure.",
        "According to the National Institute of Mental Health, Ophidiophobia is treatable through various therapies, including systematic desensitization.",
        "Ophidiophobia is characterized by an intense fear of snakes, which can lead to avoidance of outdoor activities. Treatment options include therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Acrophobia", "What is Acrophobia?", "Explain Acrophobia", "Details on Acrophobia"],
      "responses": [
        "Acrophobia is the fear of heights. This phobia can lead to anxiety attacks and avoidance of high places.",
        "Acrophobia, or the fear of heights, is a common specific phobia. Treatment options include cognitive-behavioral therapy (CBT) and exposure therapy.",
        "The fear of heights, known as Acrophobia, can cause significant distress and avoidance of high places. Therapy can help manage this phobia.",
        "According to the American Psychological Association, Acrophobia can be effectively managed with various therapeutic approaches, including gradual exposure to heights.",
        "Acrophobia is characterized by an intense fear of heights, leading to avoidance of places like tall buildings or mountains. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Agoraphobia", "What is Agoraphobia?", "Explain Agoraphobia", "Details on Agoraphobia"],
      "responses": [
        "Agoraphobia is the fear of open or crowded spaces. People with agoraphobia often avoid public places.",
        "Agoraphobia, or the fear of open spaces, can lead to significant anxiety and avoidance behaviors. Therapy, including cognitive-behavioral therapy (CBT), can be effective.",
        "The fear of open or crowded spaces, known as Agoraphobia, can cause significant distress and avoidance of public places. Therapy can help manage this phobia.",
        "According to the National Institute of Mental Health, Agoraphobia can be effectively managed with various therapeutic approaches, including gradual exposure.",
        "Agoraphobia is characterized by an intense fear of open or crowded spaces, leading to avoidance of places like malls or public transportation. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Cynophobia", "What is Cynophobia?", "Explain Cynophobia", "Details on Cynophobia"],
      "responses": [
        "Cynophobia is the fear of dogs. It is a common phobia that can be treated with therapy and gradual exposure.",
        "Cynophobia, or the fear of dogs, can lead to significant anxiety and avoidance behaviors. Therapy, including exposure therapy, can be effective.",
        "The fear of dogs, known as Cynophobia, can cause significant distress and avoidance of places where dogs might be present. Therapy can help manage this phobia.",
        "According to the American Psychological Association, Cynophobia can be effectively managed with various therapeutic approaches, including gradual exposure to dogs.",
        "Cynophobia is characterized by an intense fear of dogs, leading to avoidance of places like parks or neighborhoods with dogs. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Astraphobia", "What is Astraphobia?", "Explain Astraphobia", "Details on Astraphobia"],
      "responses": [
        "Astraphobia is the fear of thunder and lightning. It is a common phobia and often affects children.",
        "Astraphobia, or the fear of thunder and lightning, can lead to significant anxiety and avoidance behaviors. Therapy, including exposure therapy, can be effective.",
        "The fear of thunder and lightning, known as Astraphobia, can cause significant distress and avoidance of places where storms might occur. Therapy can help manage this phobia.",
        "According to the Mayo Clinic, Astraphobia can be effectively managed with various therapeutic approaches, including gradual exposure to thunder and lightning.",
        "Astraphobia is characterized by an intense fear of thunder and lightning, leading to avoidance of outdoor activities during storms. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Claustrophobia", "What is Claustrophobia?", "Explain Claustrophobia", "Details on Claustrophobia"],
      "responses": [
        "Claustrophobia is the fear of small spaces. This can cause panic attacks and avoidance of confined areas.",
        "Claustrophobia, or the fear of small spaces, is a common specific phobia. Treatment options include cognitive-behavioral therapy (CBT) and exposure therapy.",
        "The fear of small spaces, known as Claustrophobia, can cause significant distress and avoidance of confined areas. Therapy can help manage this phobia.",
        "According to the National Institute of Mental Health, Claustrophobia can be effectively managed with various therapeutic approaches, including gradual exposure to small spaces.",
        "Claustrophobia is characterized by an intense fear of small spaces, leading to avoidance of places like elevators or tunnels. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "specific_phobia",
      "patterns": ["Tell me about Mysophobia", "What is Mysophobia?", "Explain Mysophobia", "Details on Mysophobia"],
      "responses": [
        "Mysophobia is the fear of germs or dirt. This can lead to excessive cleaning and avoidance of contamination.",
        "Mysophobia, or the fear of germs, can lead to significant anxiety and avoidance behaviors. Therapy, including exposure therapy, can be effective.",
        "The fear of germs, known as Mysophobia, can cause significant distress and lead to behaviors such as excessive cleaning. Therapy can help manage this phobia.",
        "According to the Mayo Clinic, Mysophobia can be effectively managed with various therapeutic approaches, including cognitive-behavioral therapy (CBT).",
        "Mysophobia is characterized by an intense fear of germs or contamination, leading to avoidance of potentially dirty environments. Treatment often involves therapy and sometimes medication."
      ],
      "context": [""]
    },
    {
      "tag": "definition",
      "patterns": ["What is a phobia?", "Define phobia", "What does it mean to have a phobia?", "Describe a phobia"],
      "responses": [
        "A phobia is an intense, irrational fear of a specific object, situation, or activity that leads to avoidance behavior. It is a type of anxiety disorder. (APA)",
        "Phobias are excessive and unreasonable fears of an object or situation that poses little real danger but provokes anxiety and avoidance. (NIMH)",
        "A phobia is a persistent, excessive, unrealistic fear of an object, person, animal, activity, or situation. It is a type of anxiety disorder. (Mayo Clinic)",
        "Phobias are intense, irrational fears of certain things or situations. They are different from general anxiety disorders because a phobia is tied to a specific trigger. (WebMD)",
        "A phobia is a type of anxiety disorder characterized by an excessive and irrational fear of a specific object or situation. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "types",
      "patterns": ["What are the different types of phobias?", "List types of phobias", "What kinds of phobias exist?", "How many types of phobias are there?"],
      "responses": [
        "Phobias are typically categorized into specific phobias (such as fear of heights or spiders), social phobia (social anxiety disorder), and agoraphobia (fear of open or crowded spaces). (APA)",
        "There are three main types of phobias: specific phobias, social anxiety disorder (social phobia), and agoraphobia. (NIMH)",
        "Phobias can be divided into specific phobias, social phobia, and agoraphobia. Specific phobias are fears of specific objects or situations. (Mayo Clinic)",
        "Common types of phobias include specific phobias, social phobia, and agoraphobia. Each type has different triggers and symptoms. (WebMD)",
        "Phobias are generally categorized into specific phobias, social phobia, and agoraphobia. Specific phobias are fears of particular objects or situations. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "affects_whom",
      "patterns": ["Who can be affected by phobias?", "Who gets phobias?", "Are phobias common?", "Who suffers from phobias?"],
      "responses": [
        "Phobias can affect anyone, regardless of age, gender, or background. However, they often develop in childhood, adolescence, or early adulthood. (APA)",
        "Anyone can develop a phobia, but they often begin in childhood, adolescence, or early adulthood. (NIMH)",
        "Phobias are common and can affect anyone. They typically begin in childhood or adolescence. (Mayo Clinic)",
        "Phobias can affect people of all ages, backgrounds, and social situations. They often develop in childhood or early adulthood. (WebMD)",
        "Phobias can affect anyone, but they usually start in childhood, teenage years, or early adulthood. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "causes",
      "patterns": ["What causes phobias?", "How do phobias develop?", "Why do people get phobias?", "What leads to phobias?"],
      "responses": [
        "Phobias can develop due to a combination of genetic factors, brain chemistry, and traumatic experiences. Learning from family members who have phobias can also play a role. (APA)",
        "The exact cause of phobias is not known, but it is believed to be a combination of genetic predisposition and environmental factors. (NIMH)",
        "Phobias can be caused by traumatic experiences, genetic factors, and brain chemistry. Sometimes they run in families. (Mayo Clinic)",
        "Phobias may develop from a combination of genetic and environmental factors, including traumatic experiences and learned behaviors. (WebMD)",
        "The development of phobias is thought to be influenced by a combination of genetic predisposition, brain chemistry, and personal experiences. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "symptoms",
      "patterns": ["What are the symptoms of phobias?", "How can you tell if someone has a phobia?", "Signs of phobia?", "What symptoms do phobias cause?"],
      "responses": [
        "Symptoms of phobias include intense fear or anxiety when exposed to the phobic stimulus, avoidance behavior, physical symptoms like sweating or trembling, and in severe cases, panic attacks. (APA)",
        "Common symptoms of phobias include sweating, trembling, hot flashes or chills, shortness of breath, rapid heartbeat, and feeling dizzy or lightheaded. (NIMH)",
        "Phobia symptoms can include excessive fear, anxiety, panic attacks, shortness of breath, rapid heartbeat, and avoidance of the feared object or situation. (Mayo Clinic)",
        "Signs of phobias include intense anxiety, avoidance behavior, physical symptoms such as sweating and trembling, and panic attacks when confronted with the phobic trigger. (WebMD)",
        "Symptoms of phobias may include severe anxiety, panic attacks, avoidance of the feared object or situation, and physical symptoms like sweating, rapid heartbeat, and nausea. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "recover",
      "patterns": ["Can people with phobias recover?", "Is it possible to overcome a phobia?", "How do you treat phobias?", "Can phobias be cured?"],
      "responses": [
        "Yes, phobias can be treated and often overcome. Treatments include cognitive-behavioral therapy (CBT), exposure therapy, and sometimes medication. Early intervention and consistent treatment are key. (APA)",
        "People with phobias can recover with appropriate treatment, which may include therapy, medication, or a combination of both. (NIMH)",
        "Phobias are highly treatable, and many people are able to overcome their fears through therapy and medication. (Mayo Clinic)",
        "With the right treatment, including cognitive-behavioral therapy (CBT) and exposure therapy, many people with phobias can reduce or eliminate their symptoms. (WebMD)",
        "Phobias can be effectively managed and treated with therapy, medication, or a combination of treatments, allowing many individuals to lead normal lives. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "steps",
      "patterns": ["What should I do if I have a phobia?", "How to handle a phobia?", "Steps to take for phobia?", "What are the first steps in dealing with a phobia?"],
      "responses": [
        "If you have a phobia, it's important to seek help from a mental health professional. They can provide a diagnosis and create a treatment plan. Support from friends and family also plays a crucial role. (APA)",
        "The first step in dealing with a phobia is to acknowledge it and seek professional help. Therapy and support from loved ones can be very beneficial. (NIMH)",
        "If you suspect you have a phobia, consult a mental health professional for diagnosis and treatment. Early intervention can improve outcomes. (Mayo Clinic)",
        "To handle a phobia, start by talking to a mental health professional. They can recommend therapies like cognitive-behavioral therapy (CBT) and exposure therapy. (WebMD)",
        "Dealing with a phobia involves seeking professional help, exploring treatment options like therapy and medication, and getting support from family and friends. (Cleveland Clinic)"
      ],
      "context": [""]
    },
    {
      "tag": "find_help",
      "patterns": ["How do I find a mental health professional for phobias?", "Where can I get help for my phobia?", "Finding help for phobias?", "How to seek treatment for phobia?"],
      "responses": [
        "Finding a mental health professional who specializes in anxiety disorders is crucial. You can start by asking for recommendations from your primary care doctor, searching online directories, or contacting local mental health organizations. (APA)",
        "To find a mental health professional, ask for referrals from your doctor, look for specialists in anxiety disorders, or contact mental health organizations for recommendations. (NIMH)",
        "Search for mental health professionals who specialize in anxiety disorders online, ask your primary care doctor for a referral, or contact local mental health organizations. (Mayo Clinic)",
        "Look for a mental health professional with experience in treating phobias. Your primary care doctor, online directories, and mental health organizations can help. (WebMD)",
        "To find a therapist or psychiatrist who specializes in phobias, get referrals from your doctor, search online, or contact mental health organizations"]
      },
    {
              "tag": "definition",
              "patterns": ["What is a phobia?", "Define phobia", "What does it mean to have a phobia?", "Describe a phobia"],
              "responses": [
                "A phobia is an intense, irrational fear of a specific object, situation, or activity that leads to avoidance behavior. (APA)",
                "Phobias are excessive and irrational fears of specific objects or situations that interfere with daily life. (NIMH)",
                "A phobia is a type of anxiety disorder characterized by an intense fear of a specific object or situation. (Mayo Clinic)",
                "A phobia is an overwhelming and unreasonable fear of an object or situation that poses little real danger. (WebMD)",
                "Phobias are persistent, irrational fears that can cause significant distress and interfere with daily functioning. (Cleveland Clinic)"
              ]
            },
            {
              "tag": "types",
              "patterns": ["What are the different types of phobias?", "List types of phobias", "What kinds of phobias exist?", "How many types of phobias are there?"],
              "responses": [
                "Phobias are typically categorized into specific phobias, social anxiety disorder (social phobia), and agoraphobia. (APA)",
                "There are three main types of phobias: specific phobias, social phobia, and agoraphobia. (NIMH)",
                "Phobias can be divided into specific phobias, social phobia, and agoraphobia. (Mayo Clinic)",
                "Common types of phobias include specific phobias, social phobia, and agoraphobia. (WebMD)",
                "Phobias are generally categorized into specific phobias, social phobia, and agoraphobia. (Cleveland Clinic)"
              ]
            },
            {
              "tag": "affects_whom",
              "patterns": ["Who can be affected by phobias?", "Who gets phobias?", "Are phobias common?", "Who suffers from phobias?"],
              "responses": [
                "Phobias can affect anyone, regardless of age, gender, or background. (APA)",
                "Anyone can develop a phobia, but they often begin in childhood, adolescence, or early adulthood. (NIMH)",
                "Phobias are common and can affect anyone. (Mayo Clinic)",
                "Phobias can affect people of all ages, backgrounds, and social situations. (WebMD)",
                "Phobias can affect anyone, but they usually start in childhood, teenage years, or early adulthood. (Cleveland Clinic)"
              ]
            },
            {
              "tag": "causes",
              "patterns": ["What causes phobias?", "How do phobias develop?", "Why do people get phobias?", "What leads to phobias?"],
              "responses": [
                "Phobias can develop due to a combination of genetic factors, brain chemistry, and traumatic experiences. (APA)",
                "The exact cause of phobias is not known, but it is believed to be a combination of genetic predisposition and environmental factors. (NIMH)",
                "Phobias can be caused by traumatic experiences, genetic factors, and brain chemistry. (Mayo Clinic)",
                "Phobias may develop from a combination of genetic and environmental factors, including traumatic experiences and learned behaviors. (WebMD)",
                "The development of phobias is thought to be influenced by a combination of genetic predisposition, brain chemistry, and personal experiences. (Cleveland Clinic)"
              ]
            },
            {
              "tag": "symptoms",
              "patterns": ["What are the symptoms of phobias?", "How can you tell if someone has a phobia?", "Signs of phobia?", "What symptoms do phobias cause?"],
              "responses": [
                "Symptoms of phobias include intense fear or anxiety, avoidance behavior, physical symptoms like sweating or trembling, and panic attacks. (APA)",
                "Common symptoms of phobias include sweating, trembling, hot flashes, shortness of breath, rapid heartbeat, and feeling dizzy or lightheaded. (NIMH)",
                "Phobia symptoms can include excessive fear, anxiety, panic attacks, shortness of breath, rapid heartbeat, and avoidance of the feared object or situation. (Mayo Clinic)",
                "Signs of phobias include intense anxiety, avoidance behavior, physical symptoms such as sweating and trembling, and panic attacks when confronted with the phobic trigger. (WebMD)",
                "Symptoms of phobias may include severe anxiety, panic attacks, avoidance of the feared object or situation, and physical symptoms like sweating, rapid heartbeat, and nausea. (Cleveland Clinic)"
              ]
            },
            {
              "tag": "treatment",
              "patterns": ["How are phobias treated?", "What is the treatment for phobias?", "Can phobias be cured?", "How do you treat a phobia?"],
              "responses": [
                "Phobias can be treated with therapy, such as cognitive-behavioral therapy (CBT) and exposure therapy, as well as medications in some cases. (APA)",
                "Treatment for phobias may include therapy, medication, or a combination of both. (NIMH)",
                "Treatment options for phobias include therapy, medication, and lifestyle changes. (Mayo Clinic)",
                "Phobias can be effectively managed with therapy, medication, and self-help strategies. (WebMD)",
                "Treatment for phobias typically involves therapy, such as exposure therapy, and may include medication in some cases. (Cleveland Clinic)"
              ]
            }
         

        ]
      }
      